[
	{
		"etymology": "From Middle French structure, from Latin structūra (“a fitting together, adjustment, building, erection, a building, edifice, structure”), from struere, past participle structus (“pile up, arrange, assemble, build”). Compare construct, instruct, destroy, etc.\n",
		"definitions": [
			{
				"partOfSpeech": "noun",
				"text": [
					"structure (countable and uncountable, plural structures)",
					"A cohesive whole built up of distinct parts.",
					"The underlying shape of a solid.",
					"The overall form or organization of something.",
					"A set of rules defining behaviour.",
					"(computing)  Several pieces of data treated as a unit.",
					"(fishing, uncountable)  Underwater terrain or objects (such as a dead tree or a submerged car) that tend to attract fish",
					"A body, such as a political party, with a cohesive purpose or outlook.",
					"(logic)  A set along with a collection of finitary functions and relations."
				],
				"relatedWords": [],
				"examples": [
					"Synonym: formation",
					"The original family who had begun to build a palace to rival Nonesuch had died out before they had put up little more than the gateway, so that the actual structure which had come down to posterity retained the secret magic of a promise rather than the overpowering splendour of a great architectural achievement.",
					"The birds had built an amazing structure out of sticks and various discarded items.",
					"Synonym: formation",
					"He studied the structure of her face.",
					"Synonyms: makeup, configuration; see also Thesaurus:composition",
					"Drawings and pictures are more than mere ornaments in scientific discourse. Blackboard sketches, geological maps, diagrams of molecular structure, astronomical photographs, MRI images, the many varieties of statistical charts and graphs: These pictorial devices are indispensable tools for presenting evidence, for explaining a theory, for telling a story.",
					"The structure of a sentence.",
					"The structure of the society was still a mystery.",
					"For some, the structure of school life was oppressive.",
					"This structure contains both date and timezone information.",
					"There's lots of structure to be fished along the west shore of the lake; the impoundment submerged a town there when it was built.",
					"The South African leader went off to consult with the structures."
				]
			},
			{
				"partOfSpeech": "verb",
				"text": [
					"structure (third-person singular simple present structures, present participle structuring, simple past and past participle structured)",
					"(transitive) To give structure to; to arrange."
				],
				"relatedWords": [],
				"examples": [
					"I'm trying to structure my time better so I'm not always late.",
					"I've structured the deal to limit the amount of money we can lose."
				]
			}
		],
		"pronunciations": {
			"text": [
				"(UK) IPA: /ˈstɹʌktʃə(ɹ)/, [ˈstɹɐktʃə(ɹ)]",
				"(US) IPA: /ˈstɹʌktʃɚ/"
			],
			"audio": [
				"//upload.wikimedia.org/wikipedia/commons/2/21/En-us-structure.ogg",
				"//upload.wikimedia.org/wikipedia/commons/transcoded/6/68/LL-Q1860_%28eng%29-Nattes_%C3%A0_chat-structure.wav/LL-Q1860_%28eng%29-Nattes_%C3%A0_chat-structure.wav.ogg"
			]
		}
	}
]
